Конфиг21/src/Documents/УтверждениеГрафикРабот/УтверждениеГрафикРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеГрафикРабот</name>
  <registerRecords>InformationRegister.ГрафикРаботы</registerRecords>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОконч</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфиг21/src/InformationRegisters/ГрафикРаботы/ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикРаботы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РаюочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфиг21/src/Documents/УтверждениеГрафикРабот/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ГрафикРаботы.Записывать = Истина;

	ДеньГрафика = ДатаНач;
	Пока ДеньГрафика <= ДатаОконч Цикл
		Движения.ГрафикРаботы.Записывать = Истина;
	Движение = Движения.ГрафикРаботы.Добавить();
	Движение.Дата = ДеньГрафика;
	Если ДеньНедели(ДеньГрафика) <6 Тогда
	Движение.РаюочийДень = 1;
Иначе
	Движение.РаюочийДень = 0;
	КонецЕсли;
		ДеньГрафика = ДеньГрафика + 24*3600;
		КонецЦикла;
	
	
	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
